# # 1^b + 2^b + 3^b + n^b
# b = int(input("Введи число "))
# n = int(input("Введи число "))
# cnt = 0
# cnt_sum = 0
# while cnt <= n:
#     cnt_sum += cnt ** b
#     cnt += 1
# print(cnt_sum)

# for i in range(101):
#     if i == 20:
#         continue
#     print(i)

# a = int(input("Число 1 "))
# b = int(input("Число 2 "))
# for i in range(a,b+1):
#     print(i)

# x = int(input("Число "))
# sum = 0
# for i in range(x+1):
#     sum = sum + i
#     print(sum)

# for i in range(9):
#     if i % 2 == 0:
#         print("привет")

# for i in range(10):
#     print("привет")
#     i = i + 5

# 123456789 // 1 % 10 ---> 9(единицы)
# 123456789 // 10 % 10 ---> 8 (десятки)
# 123456789 // 100 % 10 ---> 7(сотни)
# 123456789 // 1000 % 10 ---> 6(тысячи)
# 123456789 // 10000 % 10 ---> 5 (десятки тысяч)
# 123456789 // 100000 % 10 ---> 4 (сотни тысяч)
# 123456789 // 1000000 % 10 ---> 3(миллионы)
# 123456789 // 10000000 % 10 ---> 2 (десятки миллионов)
# 123456789 // 100000000 % 10 ---> 1(сотни миллионов)

# i = input()
# if "п" in i.lower():
#     print("п есть в этом слове, слово", i)
# else:
#     print("Такой буквы нет")

