# дано натурульное число n. Используя // и % следует перевернуть данное число.
# n = int(input())
# while n != 0:
#     n_last = n % 10
#     n = n // 10
#     print(n_last, end="")

# натуральное 5-значное число, нужно используя простые арифм. действия вывести : 1 цифра - последняя
n = int(input())
n1 = n % 10
n2 = n // 10 % 10
n3 = n // 100 % 10
n4 = n // 1000 % 10
n5 = n // 10000 % 10
n1, n2, n3, n4, n5 = n5, n2, n3, n4, n1
print(n1, n2, n3, n4, n5)
# a = "привет" # a = 4.8
# b = 5 # b = False
# c = False # c = 5
# d = 4.8 # d = "привет"
# a, b , c , d = d, c, b, a
# print(a, b, c ,d)
