# a = input("Введите фамилию: ")
# b = input("Введите имя: ")
# c = input("Введите отчество: ")
# b1 = b[0].upper() + "."
# c1 = c[0].upper() + "."
# a2 = a[1:]
# a1 = a[0].upper() + a2
# print("ФИО:", a1, b1, c1)

# a = "привет" + "мир"
# print(a)
# b = "привет мир \n" * 100
# print(b)

# # Условные операторы - if, elif, else
# a = int(input("Введите число: "))
# print(type(a))
# if a == 1:
#     print("привет!")
# else:
#     print("что-то пошло не так")

# a = input("Введите число: ")
# print(type(a))
# if int(a) == 1:
#     print("привет!")
# else:
#     print("что-то пошло не так")

# a = input("Введите число: ")
# print(type(a))
# if a == "1":
#     print("привет!")
# if a == "привет":
#     print("Вы ввели слово")
# else:
#     print("что-то пошло не так")

# операторы сравнения - >, <, >=, <=, ==, !=

a = int(input("Введите число "))
if a > 10:
    print(">10")
if a % 2 == 0:
    print("Число четное ")
else:
    print("Условие не выполнено")
